"use client"
import React, {useEffect, useState} from "react";
import Slider from "@/components/Slider";
import VideoPlayer from "@/components/VideoPlayer";
import Reviews from "@/components/Reviews";
import {motion} from "framer-motion";
import {useRouter, useSearchParams} from "next/navigation";
import ReviewPop from "@/components/ReviewPop";
import HelpPop from "@/components/HelpPop";


import {Swiper, SwiperSlide, useSwiperSlide} from "swiper/react";

// Import Swiper styles
import "swiper/css";
import "swiper/css/pagination";
import 'swiper/css/effect-fade';


// import required modules
import {
    Mousewheel,
    EffectCoverflow,
    Pagination,
    Autoplay,
    EffectCards,
    EffectCreative,
    EffectCube,
    EffectFade,
    EffectFlip
} from "swiper";
import post from "@/components/Post";
import Link from "next/link";
import concatStr from "@/helpers/concatStr";
import {classList} from "@/helpers/classList";
import SpeakersSlider from "@/components/SpeakersSlider";
import News from "@/components/News";
import Partners from "@/components/Partners";
import PopUp from "@/components/PopUp";
import compareDates from "@/helpers/compareDates";
import ConfirmForm from "@/components/ConfirmForm";
import BackButton from "@/components/BackButton";
import {eden} from "@/helpers/sdk";
import QRCode from "react-qr-code";
import Partners11 from "@/components/Partners11";
import Partners18 from "@/components/Partners18";
import {format} from "date-fns";
import Partners13 from "@/components/Partners13";
import Partners08 from "@/components/Partners08";
import StandLoadingBar from "@/components/StandLoadingBar";
import Partners31 from "@/components/Partners31";
import Partners911 from "@/components/Partners911";
import Partners2610 from "@/components/Partners2610";

export const dynamic = "force-dynamic"

export default function Page({params}: any) {

    const router = useRouter()
    const images = '/pages/events'


    //temp data


    const event={
        "_id": "6657492d1f24ed21e45be5c9",
        "type": "Конференция",
        "date": "09.11.2024",
        "dateStart": "2024-11-09T07:00:00.000Z",
        "dateEnd": "2024-11-09T13:00:00.000Z",
        "timePeriod": "10:00",
        "name": "X Юбилейная всероссийская научно-практическая конференция с международным участием «Дерматологические чтения в педиатрии»",
        "place": " г.Москва, кластер \"Ломоносов\", ул.Раменский б-р 1",
        "format": "онлайн + очное участие (личное присутствие) ",
        "participants": 7298,
        "layoutBg": "/pages/09_11_conference.JPG",
        "avatar": "/conference_avatar.png",
        "announcement": "09  ноября 2024 г. на площадке новой технологической долины МГУ в центре Москвы для мероприятий цифровой направленности, посвященных прорывным инновациям и новым трендам в мире здравоохранения, состоится главное событие 2024 года - X Юбилейная всероссийская научно-практическая конференция с международным участием «Дерматологические чтения в педиатрии».",
        "description": "В рамках научной программы конференции будут обсуждаться наиболее актуальные проблемы дерматологии детского возраста, наряду с разбором редких клинических ситуаций и представлением результатов последних мировых научных исследований. Особое внимание будет уделено современному ведению пациентов с генодерматозами, аутоиммунными и аутовоспалительными кожными патологиями, а также дерматоскопической диагностике и тактике лечения различных новообразований кожи у детей. Кроме того, будут рассматриваться современные тенденции терапии атопического дерматита, псориаза, вульгарных акне и ассоциированных с акне синдромов, андрогенетической и гнездной алопеции.",
        "speakers": [
            {
                "name": "Амбарчян Эдуард Тигранович ",
                "contact": "edo_amb@mail.ru",
                "post": "Кандидат медицинских наук",
                "description": "Кандидат медицинских наук, врач-дерматовенеролог, заведующий отделением дерматологии в НИИ педиатрии и охраны здоровья детей ФГБНУ «РНЦХ им. академика Б.В. Петровского», Член Европейского Общества Детских Дерматологов (ESPD), Член Союза Педиатров России",
                "photo": "/pages/main/employers/ambarchyan.png"
            },
            {
                "name": "Андреас Волленберг",
                "post": "Профессор",
                "contact": "-",
                "description": "Профессор, доктор медицины, руководитель отделения детской дерматологии в Университетской клинике Мюнхена (LMU München)",
                "photo": "/pages/main/employers/vollendberg.png"
            },
            {
                "name": "Антонио Торрело",
                "post": "Доктор медицинских наук",
                "contact": "-",
                "description": "Доктор медицинских наук, профессор, заведующий отделением дерматологии в Детской больнице дель Ниньо Хесус в Мадриде (Department of Dermatology in the Children’s Hospital del Niño Jesús in Madrid)",
                "photo": "/pages/main/employers/torello.png"
            },
            {
                "name": "Аравийская Елена Александровна",
                "description": "Профессор кафедры дерматовенерологии с клиникой Первого Санкт-Петербургского ГМУ, руководитель Последипломного цикла обучения по косметологии для врачей. Член Совета директоров Европейской академии дерматологии и венерологии, член Правления Санкт-Петербургского общества дерматовенерологов, почетный член Общества дерматологов Франции и Сербии.",
                "post": "Профессор",
                "contact": "arelenar@mail.ru",
                "photo": "/pages/main/employers//araviyskaya.png"
            },
            {
                "name": "Белышева Татьяна Сергеевна",
                "description": "Доктор медицинских наук, ведущий научный сотрудник, врач-дерматолог, детский онколог НИИ детской онкологии и гематологии им. акад. РАМН Л.А.Дурнова ФГБУ \"НМИЦ онкологии им. Н.Н.Блохина\" Минздрава России",
                "contact": "klinderma@bk.ru",
                "post": "Доктор медицинских наук",
                "photo": "/pages/main/employers/belysheva.png"
            },
            {
                "name": "Бурлаков Василий Игоревич ",
                "description": "Врач-иммунолог отделения иммунологии НМИЦ ДГОИ  им.Д.Рогачева. М.н.с. отдела оптимизации лечения первичных иммунодефицитов.",
                "post": "Спикер",
                "contact": "sarovas@yandex.ru",
                "photo": "/pages/main/employers/burlakov.png"
            },
            {
                "name": "Галимова Альбина Альбертовна",
                "description": "Врач - аллерголог - иммунолог, младший научный сотрудник ФГАУ \"НМИЦ здоровья детей\" Минздрава России",
                "post": "Спикер",
                "contact": "albina86@yandex.ru",
                "photo": "/pages/main/employers/galimova.png"
            },
            {
                "name": "Епишев Роман Владимирович ",
                "post": "Кандидат медицинских наук",
                "contact": "drepishev@gmail.com",
                "description": "Кандидат медицинских наук, врач-дерматовенеролог отделения дерматологии и аллергологии ФГАУ «Национальный медицинский исследовательский центр здоровья детей» Минздрава России, научный сотрудник лаборатории патологии кожи у детей отдела научных исследований в педиатрии ФГАУ «Национальный медицинский исследовательский центр здоровья детей» Минздрава России. Член Европейского общества детских дерматологов (European Society for Pediatric Dermatology).",
                "photo": "/pages/main/employers/epishev.png"
            },
            {
                "name": "Ерешко Оксана Александровна ",
                "post": "Кандидат медицинских наук",
                "contact": "ksenya2005@inbox.ru",
                "description": "Кандидат медицинских наук, врач-аллерголог отделения дерматологии и аллергологии ФГАУ «Национальный медицинский исследовательский центр здоровья детей» Минздрава России, старший научный сотрудник Национального медицинского центра здоровья детей.",
                "photo": "/pages/main/employers/ereshko.png"
            },
            {
                "name": "Жарков Илья Павлович ",
                "post": "Спикер",
                "contact": "dr.zharkov@bk.ru",
                "description": "Врач-дерматовенеролог, г.Саранск",
                "photo": "/pages/main/employers/zharkov.png"
            },
            {
                "name": "Иванов Роман Александрович ",
                "post": "Кандидат медицинских наук",
                "contact": "isxiks@gmail.com",
                "description": "Кандидат медицинских наук, врач-дерматовенеролог отделения дерматологии и аллергологии ФГАУ «Национальный медицинский исследовательский центр здоровья детей» Минздрава России, научный сотрудник лаборатории патологии кожи у детей отдела научных исследований в педиатрии ФГАУ «Национальный медицинский исследовательский центр здоровья детей» Минздрава России. Член Европейского общества детских дерматологов (European Society for Pediatric Dermatology).",
                "photo": "/pages/main/employers/ivanov.png"
            },
            {
                "name": "Котова Евгения Григорьевна ",
                "post": "Спикер",
                "contact": "-",
                "description": "Заместитель Министра здравоохранения Российской Федерации",
                "photo": "/pages/main/employers/kotova.png"
            },
            {
                "name": "Крис Каллеверт",
                "post": "Спикер",
                "contact": "-",
                "description": "Доктор, специалист в области микробиологии кожи  (Ghent University, Belgium)",
                "photo": "/pages/main/employers/kalevert.png"
            },
            {
                "name": "Круглова Лариса Сергеевна ",
                "post": "Доктор медицинских наук",
                "contact": "kruglovals@mail.ru",
                "description": "Доктор медицинских наук, профессор, заведующая кафедрой дерматовенерологии и косметологии Центральной государственной медицинской академии Управделами Президента РФ",
                "photo": "/pages/main/employers/kruglova.png"
            },
            {
                "name": "Куратова Алёна Александровна ",
                "post": "Спикер",
                "description": "Учредитель и руководитель БФ «Дети-бабочки», основатель Международной Ассоциации по Генетическим Заболеваниям",
                "contact": "akuratova@deti-bela.ru",
                "photo": "/pages/main/employers/kuratova.png"
            },
            {
                "name": "Ладанова Елена Сергеевна ",
                "post": "Спикер",
                "contact": "leno4ka_l90@mail.ru",
                "description": "врач-педиатр , ассистент кафедры пропедевтики детских болезней ФГБОУ ВО РостГМУ Минздрава России.",
                "photo": "/pages/main/employers/ladanova.png"
            },
            {
                "name": "Леонова Мария Алексеевна ",
                "description": "Кандидат медицинских наук, врач-дерматовенеролог отделения дерматологии и аллергологии ФГАУ «Национальный медицинский исследовательский центр здоровья детей» Минздрава России",
                "post": "Кандидат медицинских наук",
                "contact": "dr.maria.leonova@gmail.com",
                "photo": "/pages/main/employers/leonova.png"
            },
            {
                "name": "Львов Андрей Николаевич ",
                "post": "Доктор медицинских наук",
                "contact": "alvov@mail.ru",
                "description": "Доктор медицинских наук, профессор  кафедры дерматовенерологии и косметологии Центральной государственной медицинской академии Управделами Президента РФ",
                "photo": "/pages/main/employers/lvov.png"
            },
            {
                "name": "Материкин Александр Игоревич ",
                "post": "Кандидат медицинских наук",
                "contact": "al_m86@bk.ru",
                "description": "Кандидат медицинских наук, врач-дерматовенеролог отделения дерматологии и аллергологии ФГАУ «Национальный медицинский исследовательский центр здоровья детей» Минздрава России, научный сотрудник лаборатории патологии кожи у детей отдела научных исследований в педиатрии ФГАУ «Национальный медицинский исследовательский центр здоровья детей» Минздрава России. Член Европейского общества детских дерматологов (European Society for Pediatric Dermatology).",
                "photo": "/pages/main/employers/materikin.png"
            },
            {
                "name": "Меджидов Артур Рамазанович ",
                "post": "Спикер",
                "contact": "Dr.Medzhidov@gmail.com ",
                "description": "Детский хирург, специалист по сосудистым опухолям и аномалиям развития",
                "photo": "/pages/main/employers/medzhidov.png"
            },
            {
                "name": "Мурашкин Николай Николаевич",
                "post": "Президент",
                "contact": "m_nn2001@mail.ru",
                "description": "Президент МОО «Общество детских дерматологов». Руководитель НИИ детской дерматологии, доктор медицинских наук, профессор, заведующий отделением дерматологии и  аллергологии ФГАУ «Национальный медицинский исследовательский центр здоровья детей» Минздрава России, заведующий лабораторией патологии кожи у детей отдела научных исследований в педиатрии ФГАУ «Национальный медицинский исследовательский центр здоровья детей» Минздрава России. Профессор кафедры педиатрии и детской ревматологии Первого Московского государственного медицинского университета им. И.М. Сеченова (Сеченовский Университет), профессор кафедры дерматовенерологии и косметологии Федерального государственного бюджетного учреждения дополнительного профессионального образования «Центральная государственная медицинская академия» Управления делами Президента Российской Федерации, член правления Европейского общества детской дерматологии (European Society for Pediatric Dermatology), эксперт DEBRA International.",
                "photo": "/pages/main/employers/murashkin.png"
            },
            {
                "name": "Опрятин Леонид Андреевич ",
                "contact": "opryatin.l@gmail.com",
                "post": "Кандидат медицинских наук",
                "description": "Кандидат медицинских наук, врач-дерматовенеролог отделения дерматологии и аллергологии ФГАУ «Национальный медицинский исследовательский центр здоровья детей» Минздрава России, научный сотрудник лаборатории патологии кожи у детей отдела научных исследований в педиатрии ФГАУ «Национальный медицинский исследовательский центр здоровья детей» Минздрава России. Член Европейского общества детских дерматологов (European Society for Pediatric Dermatology).",
                "photo": "/pages/main/employers/opryatin.png"
            },
            {
                "name": "Орлова Ольга Сергеевна ",
                "post": "Спикер",
                "contact": "orlova@deti-bela.ru ",
                "description": "Врач-дерматолог ГБУЗ МО «НИКИ детства МЗ МО», м.н.с. лаборатории патологии кожи у детей ФГАУ «НМИЦ здоровья детей» Минздрава России,  эксперт БФ \"Дети-бабочки\"",
                "photo": "/pages/main/employers/orlova.png"
            },
            {
                "name": "Павлова Екатерина Станиславовна ",
                "post": "Спикер",
                "contact": "-",
                "description": "Врач-дерматовенеролог отделения дерматологии и аллергологии ФГАУ «Национальный медицинский исследовательский центр здоровья детей» Минздрава России",
                "photo": "/pages/main/employers/pavlova.png"
            },
            {
                "name": "Поленова Виктория Сергеевна",
                "post": "Кандидат медицинских наук",
                "contact": "vpolenova@deti-bela.ru",
                "description": "Кандидат медицинских наук, президент Международной ассоциации руководителей здравоохранения, преподаватель ФГБУ «ВНИИМТ» Росздравнадзора, руководитель Отдела развития научных проектов Благотворительного фонда «Дети-бабочки»",
                "photo": "/pages/main/employers/polenova.png"
            },
            {
                "name": "Семёнова Вера Владимировна",
                "contact": "sulpiridum@yandex.ru",
                "post": "Спикер",
                "description": "Врач-генетик поликлинического отделения НИИ детской онкологии и гематологии им. академика РАМН Л.А. Дурнова ФГБУ «НМИЦ онкологии им. Н.Н. Блохина» Минздрава России, г. Москва. Младший научный сотрудник лаборатории биологических микрочипов Федерального государственного бюджетного учреждения науки Института молекулярной биологии им. В.А. Энгельгардта Российской академии наук, г. Москва. ",
                "photo": "/pages/main/employers/semenova.png"
            },
            {
                "name": "Возницын Лев Владимирович",
                "post": "Спикер",
                "contact": "-",
                "description": "Ассистент кафедры Детской челюстно-лицевой хирургии Российского университета медицины, врач клиники Медалье, вице-президент по научному развитию РОИСА",
                "photo": "/pages/main/employers/voznitsyn.png"
            },
            {
                "name": "Стенько Анна Германовна ",
                "contact": "stenko@mail.ru",
                "description": "Доктор медицинских наук, профессор кафедры дерматовенерологии и косметологии ФГБУ ДПО «Центральная Государственная Медицинская Академия» Управления делами Президента РФ, член-корреспондент РАЕН, заведующая отделением косметологии Института пластической хирургии и косметологии",
                "post": "Доктор медицинских наук",
                "photo": "/pages/main/employers/stenko.png"
            },
            {
                "name": "Тупыленко Артём Викторович ",
                "post": "Кандидат медицинских наук",
                "contact": "tupylenkoav@mail.ru",
                "description": "Кандидат медицинских наук, врач-эндоскопист отделения эндоскопических исследований,старший научный сотрудник ФГАУ «Национальный медицинский исследовательский центр здоровья детей» Минздрава России",
                "photo": "/pages/main/employers/tupylenko.png"
            },
            {
                "name": "Фёдоров Дмитрий Валерьевич ",
                "post": "Кандидат медицинских наук",
                "contact": "aldo.89@mail.ru",
                "description": "Кандидат медицинских наук, врач-косметолог, дерматовенеролог, трихолог, главный врач отделения косметологи Санкт-Петербургского института СПИК. Медицинский советник международной фармацевтической компании Allergan. Член Европейского общества детских дерматологов (European Society for Pediatric Dermatology)",
                "photo": "/pages/main/employers/fedorov.png"
            },
            {
                "name": "Фисенко Андрей Петрович ",
                "post": "Профессор",
                "description": "Директор ФГАУ \"НМИЦ здоровья детей\" Минздрава России, д.м.н., профессор.",
                "contact": "-",
                "photo": "/pages/main/employers/fisenko.png"
            },
            {
                "name": "Сергеев Юрий Юрьевич",
                "contact": "-",
                "description": "практикующий врач-дерматовенеролог, ассистент кафедры дерматовенерологии и косметологии ЦГМА УДП РФ и Член Правления Общества дерматоскопии и оптической диагностики кожи.",
                "photo": "/pages/main/employers/sergeev.png",
                "post": "Спикер"
            }
        ],
        "halls": [
            {
                "program": [
                    {
                        "substages": [
                            {
                                "subsubstages": [],
                                "name": "Открытие. Приветственное слово.",
                                "timePeriod": "10:00-10:30",
                                "description": "Президент МОО «Общества детских дерматологов», д.м.н., профессор Н.Н. Мурашкин,  Директор ФГАУ \"НМИЦ здоровья детей\" Минздрава России, д.м.н., профессор А.П. Фисенко, Заместитель Министра здравоохранения Российской Федерации Е.Г. Котова, Директор Департамента медицинской помощи детям, службы родовспоможения и общественного здоровья Минздрава России, к.м.н. Е.Л. Шешко, Учредитель и руководитель БФ «Дети-бабочки», основатель Международной Ассоциации по Генетическим Заболеваниям А.А. Куратова"
                            },
                            {
                                "subsubstages": [],
                                "name": "Демонстрация клинических случаев года",
                                "timePeriod": "10:30-10:50",
                                "description": "к.м.н. Р.В. Епишев, к.м.н. А.И. Материкин, к.м.н Л.А. Опрятин, к.м.н М.А. Леонова, Е.С. Павлова, Е.С. Ладанова, И.П. Жарков"
                            },
                            {
                                "subsubstages": [],
                                "name": "Пленарный доклад. Неизведанные просторы детской дерматологии: новые болезни, малоизученные вопросы и  современные терапевтические стратегии",
                                "timePeriod": "10:50-11:15",
                                "description": "д.м.н., профессор Н.Н. Мурашкин "
                            },
                            {
                                "subsubstages": [],
                                "name": "В поисках оптимального решения: разбор современных методов лечения атопического дерматита у детей",
                                "timePeriod": "11:15-11:30",
                                "description": "д.м.н., профессор Н.Н. Мурашкин ",
                                "sponsor": " ООО «Свикс Хэлскеа». Баллы НМО не начисляются"
                            },
                            {
                                "subsubstages": [],
                                "name": "Перерыв",
                                "timePeriod": "11:30-11:45"
                            }
                        ],
                        "name": "ЦЕРЕМОНИЯ ОТКРЫТИЯ КОНФЕРЕНЦИИ",
                        "timePeriod": "10:00-11:30"
                    },
                    {
                        "substages": [
                            {
                                "subsubstages": [],
                                "name": "Акне: update",
                                "timePeriod": "11:45 -12:15",
                                "description": "д.м.н., профессор Е.А. Аравийская",
                                "sponsor": "Galderma. Баллы НМО не начисляются."
                            },
                            {
                                "subsubstages": [],
                                "name": "Себорейный дерматит у детей: эффективные схемы терапии",
                                "timePeriod": "12:15 – 12:30",
                                "description": "д.м.н., профессор Л.С. Круглова"
                            },
                            {
                                "subsubstages": [],
                                "timePeriod": "12:13-12:45",
                                "name": "Психодерматологические аспекты экскориативного поведения в фациальной проекции у детей",
                                "description": "д.м.н., профессор А.Н. Львов",
                                "sponsor": "LEO Pharma. Баллы НМО не начисляются."
                            },
                            {
                                "subsubstages": [],
                                "timePeriod": "12:45 – 13:00",
                                "name": "Высыпания назальной области у детей и подростков: когда есть причина для беспокойства?",
                                "description": "д.м.н., профессор Е.А. Аравийская",
                                "sponsor": "Viatris. Баллы НМО не начисляются."
                            },
                            {
                                "subsubstages": [],
                                "timePeriod": "13:00 - 13:15",
                                "name": "Роль ретиноидов в детской дерматологии: оптимизация терапии и контроль безопасности",
                                "description": "д.м.н., профессор Н.Н. Мурашкин "
                            }
                        ],
                        "name": "I СИМПОЗИУМ - Секреты патологических изменений кожи лица в детском возрасте",
                        "timePeriod": "11:45-13:15",
                        "speaker": "Модератор: д.м.н., профессор Е.А. Аравийская и д.м.н., профессор Л.С. Круглова"
                    },
                    {
                        "substages": [],
                        "name": "Перерыв (ответы на вопросы)",
                        "timePeriod": "13:15-13:45"
                    },
                    {
                        "substages": [
                            {
                                "subsubstages": [],
                                "name": "Современные стратегии модификации течения атопического дерматита в детском возрасте: новые достижения и клинические перспективы ",
                                "timePeriod": "13:45 – 15:15",
                                "description": "д.м.н., профессор Н.Н. Мурашкин, д.м.н., профессор Е.А. Аравийская, д.м.н., профессор Л.С. Круглова",
                                "sponsor": "Sanofi. Баллы НМО не начисляются."
                            },
                            {
                                "subsubstages": [],
                                "name": "Системное влияние и кумулятивные последствия  Т2-воспаления при атопическом дерматите у детей",
                                "timePeriod": "13:45 – 14:15",
                                "description": "д.м.н., профессор Л.С. Круглова"
                            },
                            {
                                "subsubstages": [],
                                "name": "Концепция болезнь-модифицирующей терапии: критический обзор имеющихся данных",
                                "timePeriod": "14:15 – 14:45",
                                "description": "д.м.н., профессор Е.А. Аравийская"
                            },
                            {
                                "subsubstages": [],
                                "name": "Управление контролем и ремиссией атопического дерматита в теории и на практике ",
                                "description": "д.м.н., профессор Н.Н. Мурашкин",
                                "timePeriod": "14:45-15:15"
                            }
                        ],
                        "name": "II СИМПОЗИУМ - Атопический дерматит – лечение с фокусом на будущее",
                        "timePeriod": "13:45 – 15:15"
                    },
                    {
                        "substages": [],
                        "name": "Перерыв (ответы на вопросы)",
                        "timePeriod": "15:15-15:30"
                    },
                    {
                        "substages": [
                            {
                                "subsubstages": [],
                                "name": "Первичные иммунодефициты в детской дерматологической практике: распространенные и редкие клинические ситуации",
                                "timePeriod": "15:30 -  15:45",
                                "description": "к.м.н. Р.А. Иванов",
                                "sponsor": "Glenmark. Баллы НМО не начисляются."
                            },
                            {
                                "subsubstages": [],
                                "name": "Кожные формы красной волчанки в детском возрасте: от клиники к лечению",
                                "timePeriod": "15:45 – 16:00",
                                "description": "к.м.н. А.И. Материкин"
                            },
                            {
                                "subsubstages": [],
                                "name": "Красный плоский лишай в практике детского дерматолога: сложности диагностики и ведения пациентов . ",
                                "timePeriod": "16:00 – 16:15",
                                "description": "к.м.н. Р.В. Епишев"
                            },
                            {
                                "subsubstages": [],
                                "name": "Блокирование сигнального пути JAK/STAT: руководство выбора оптимальной терапии атопического дерматита у подростков",
                                "timePeriod": "16:15 – 16:30",
                                "description": "д.м.н., профессор Н.Н. Мурашкин ",
                                "sponsor": "ЭббВи. Баллы НМО не начисляются."
                            },
                            {
                                "subsubstages": [],
                                "timePeriod": "16:30 – 16:45",
                                "name": "Возможности достижения долгосрочной ремиссии при псориазе у детей: ключевые факторы и предпосылки успешного контроля над заболеванием",
                                "description": "д.м.н., профессор Н.Н. Мурашкин",
                                "sponsor": "ООО Джонсон & Джонсон. Баллы НМО не начисляются."
                            },
                            {
                                "subsubstages": [],
                                "name": "Гнездная алопеция: научные данные, меняющие подход к лечению",
                                "timePeriod": "16:45 - 17:00",
                                "description": "к.м.н. Э.Т. Амбарчян"
                            }
                        ],
                        "name": "III СИМПОЗИУМ - Иммуноопосредованные дерматозы детского возраста",
                        "timePeriod": "15:30-17:00",
                        "speaker": "Модератор: д.м.н., профессор Н.Н. Мурашкин, к.м.н. Р.В. Епишев"
                    },
                    {
                        "substages": [],
                        "timePeriod": "17:00-17:15",
                        "name": "Перерыв (ответы на вопросы)"
                    },
                    {
                        "substages": [
                            {
                                "subsubstages": [],
                                "name": "Терапия off-label в лечении дерматозов детского возраста",
                                "timePeriod": "17:15-17:45",
                                "description": "профессор Антонио Торрело (Испания)"
                            },
                            {
                                "subsubstages": [],
                                "name": "Новая эра таргетного лечения аутоиммунных буллезных дерматозов: доступные терапевтические возможности и революционные стратегии будущего",
                                "timePeriod": "17:45-18:05",
                                "description": "д.м.н., профессор Н.Н. Мурашкин"
                            },
                            {
                                "subsubstages": [],
                                "name": "Разбор клинических случаев года",
                                "timePeriod": "18:05-18:30",
                                "description": "к.м.н. Р.В. Епишев, к.м.н. А.И. Материкин, к.м.н Л.А. Опрятин, к.м.н М.А. Леонова, Е.С. Павлова, Е.С. Ладанова, И.П. Жарков"
                            }
                        ],
                        "name": "IV СИМПОЗИУМ - Заглядывая в будущее детской дерматологии: новые горизонты и возможности",
                        "timePeriod": "17:15-18:30"
                    },
                    {
                        "substages": [],
                        "name": "ЗАКРЫТИЕ КОНФЕРЕНЦИИ. Обсуждение, ответы на вопросы",
                        "timePeriod": "18:30-18:45"
                    }
                ],
                "name": "Зал \"ФОРУМ СИНЕРГИИ\"",
                "streamLink": "https://a5prokat.clients.webcaster.pro/iframe/feed/start/free_aa05b0ee5e0172a8647c3f4f26c52651/5847_5114357117/74841a069fb10f387b86605347494c92/4886671728?sr=6227&type_id="
            },
            {
                "program": [
                    {
                        "substages": [
                            {
                                "subsubstages": [],
                                "timePeriod": "11:45 – 12:00",
                                "name": "Жизнеугрожающие дерматозы на фоне противоопухолевой терапии: ранняя диагностика и тактика ведения",
                                "description": "к.м.н. А.В. Миченко"
                            },
                            {
                                "subsubstages": [],
                                "name": "Солитарная инфантильная гемангиома кожи у детей: безобидное образование или вершина айсберга проблемы?",
                                "timePeriod": "12:00 – 12:15",
                                "description": "д.м.н., профессор Т.С. Белышева"
                            },
                            {
                                "subsubstages": [],
                                "name": "Биологически злокачественная «доброкачественная» опухоль кожи – случай метастазирующей дерматофибромы у ребенка",
                                "timePeriod": "12:15 – 12:30",
                                "description": "Е.В. Шарапова"
                            },
                            {
                                "subsubstages": [],
                                "name": "Агрессивное течение синдрома Горлина-Гольца у ребенка 5 лет",
                                "timePeriod": "12:30 – 12:45",
                                "description": "В.В. Семенова"
                            },
                            {
                                "subsubstages": [],
                                "name": "Современные возможности терапии рубцов в детском возрасте: эффективные методики и подходы",
                                "timePeriod": "12:45 – 13:00",
                                "description": "д.м.н., профессор Стенько А.Г."
                            },
                            {
                                "subsubstages": [],
                                "timePeriod": "13:00 – 13:15",
                                "name": "Акральная меланома у детей: диалог с развенчанием мифов",
                                "description": "д.м.н., профессор Т.С. Белышева и Ю.Ю. Сергеев"
                            }
                        ],
                        "name": "I СИМПОЗИУМ - Больше, чем дерматология…",
                        "timePeriod": "11:45-13:15",
                        "speaker": "Модератор: д.м.н., профессор Т.С. Белышева и д.м.н., профессор А.Г. Стенько"
                    },
                    {
                        "substages": [],
                        "timePeriod": "13:15-13:45",
                        "name": "Перерыв (ответы на вопросы)"
                    },
                    {
                        "substages": [
                            {
                                "subsubstages": [],
                                "name": "Лазеры в детской дерматологии: кому, когда и как?",
                                "timePeriod": "13:45 – 14:00",
                                "description": "к.м.н. И.А. Ахмедбаева "
                            },
                            {
                                "subsubstages": [],
                                "name": "Лечение инфантильных гемангиом и сосудистых мальформаций у детей: обобщенные данные 15-летнего опыта",
                                "timePeriod": "14:00- 14:15",
                                "description": "д.м.н., профессор Т.С. Белышева"
                            },
                            {
                                "subsubstages": [],
                                "name": "Гемангиомы и сосудистые мальформации: обзор методов лечения и комбинированных протоколов",
                                "timePeriod": "14:15 – 14:30",
                                "description": "Л.В. Возницын"
                            },
                            {
                                "subsubstages": [],
                                "name": "Лечение младенческих гемангиом и капиллярных мальформаций с помощью импульсного лазера на красителе",
                                "timePeriod": "14:30 – 14:45",
                                "description": "А.Р. Меджидов"
                            },
                            {
                                "subsubstages": [],
                                "name": "Есть проблема - пигментация, есть решение - лазеры",
                                "timePeriod": "14:45 – 15:00",
                                "description": "к.м.н. И.А. Ахмедбаева"
                            },
                            {
                                "subsubstages": [],
                                "name": "Осложнения после аппаратных методов лечения эстетических проблем и их коррекция у детей и подростков ",
                                "timePeriod": "15:00 – 15:15",
                                "description": "к.м.н. Д.В. Федоров",
                                "sponsor": "Glenmark. Баллы НМО не начисляются."
                            }
                        ],
                        "name": "II СИМПОЗИУМ- Вопросы косметологии в детском возрасте: на стыке эстетики и здоровья",
                        "speaker": "Модератор: д.м.н., профессор Т.С. Белышева, к.м.н. Д.В. Федоров",
                        "timePeriod": "13:45 – 15:15"
                    },
                    {
                        "substages": [],
                        "name": "Перерыв (ответы на вопросы)",
                        "timePeriod": "15:15-15:30"
                    },
                    {
                        "substages": [
                            {
                                "subsubstages": [],
                                "name": "Хроническая идиопатическая крапивница: вопросы дифференциальной диагностики и терапевтической тактики в детском возрасте ",
                                "timePeriod": "15:30 -  15:45",
                                "description": "к.м.н. О.А. Ерешко"
                            },
                            {
                                "subsubstages": [],
                                "name": "Пустулезный псориаз и псориатическая эритродермия: экстренные методы лечения в клинической практике",
                                "timePeriod": "15:45 – 16:00",
                                "description": "д.м.н., профессор Н.Н. Мурашкин ",
                                "sponsor": " ООО «Свикс Хэлскеа». Баллы НМО не начисляются"
                            },
                            {
                                "subsubstages": [],
                                "name": " Синдром Стивенса-Джонсона и Лайелла у детей: актуальные протоколы ведения пациентов",
                                "timePeriod": "16:00 – 16:15",
                                "description": "к.м.н. Л.А. Опрятин"
                            },
                            {
                                "subsubstages": [],
                                "name": "Первый российский опыт терапии кожной формы мастоцитоза у детей ингибиторами тирозинкиназ",
                                "timePeriod": "16:15 – 16:30",
                                "description": "д.м.н., профессор Т.Т. Валиев"
                            },
                            {
                                "subsubstages": [],
                                "name": "Тяжелые инфекционные дерматозы у детей: основы диагностики и тонкости терапии",
                                "timePeriod": "16:30 – 16:45",
                                "description": "к.м.н. М.А. Леонова"
                            },
                            {
                                "subsubstages": [],
                                "name": "Искусство ведения раневых дефектов в детской дерматологической практике: современные вызовы и их решения",
                                "timePeriod": "16:45 - 17:00",
                                "description": "д.м.н., профессор Н.Н. Мурашкин и д.м.н., профессор Е.А. Аравийская"
                            }
                        ],
                        "name": "III СИМПОЗИУМ - Неотложные ситуации в детской дерматологии",
                        "timePeriod": "15:30-17:00",
                        "speaker": "Модератор: д.м.н., профессор Т.Т. Валиев и к.м.н. Л.А. Опрятин"
                    },
                    {
                        "substages": [],
                        "name": "Перерыв (ответы на вопросы)",
                        "timePeriod": "17:00-17:15"
                    }
                ],
                "name": "Зал \"КОДЕКС ПРОГРЕССА\"",
                "streamLink": "https://a5prokat.clients.webcaster.pro/iframe/feed/start/free_d46cb14ef34f336017eb3c073d12d300/5847_7351464419/09d33588ef36c93712e90d71a6aa152b/4886671975?sr=6227&type_id="
            },
            {
                "program": [
                    {
                        "substages": [
                            {
                                "subsubstages": [],
                                "name": "Вступительное слово ",
                                "timePeriod": "11:45 – 11:50"
                            },
                            {
                                "subsubstages": [],
                                "name": "Термальная вода: гидротерапия, данные фармацевтических и клинических исследований",
                                "timePeriod": "11:50 – 12:05",
                                "description": " генеральный директор Центра гидротерапии, профессор Софи Мери, Франция",
                                "sponsor": "Pierre Fabre. Баллы НМО не начисляются"
                            },
                            {
                                "subsubstages": [],
                                "name": "Лечение и уход: роль эмолентов в купировании зуда и воспаления при атопическом дерматите детского возраста ",
                                "timePeriod": "12:05 – 12:40",
                                "description": "д.м.н., профессор Н.Н. Мурашкин"
                            },
                            {
                                "subsubstages": [],
                                "timePeriod": "12:40 – 12:50",
                                "name": "Дискуссия. Ответы на вопросы"
                            }
                        ],
                        "name": "I СИМПОЗИУМ - Роль специализированной дерматокосметики в борьбе с атопией: наука и практика",
                        "timePeriod": "11:45-13:15",
                        "speaker": "Модератор: д.м.н., профессор Н.Н. Мурашкин"
                    },
                    {
                        "substages": [],
                        "name": "Перерыв (ответы на вопросы)",
                        "timePeriod": "13:15-13:45"
                    },
                    {
                        "substages": [
                            {
                                "subsubstages": [],
                                "timePeriod": "13:45 – 14:30",
                                "name": "Комедоны и воспаление при акне. Две мишени – одна цель: от базовой теории к доказанной практике",
                                "description": "д.м.н., профессор А.Н. Львов"
                            },
                            {
                                "subsubstages": [],
                                "timePeriod": "14: 30 – 14:45",
                                "name": "Роль Malassezia spp. в патологии кожи лица, головы и тела",
                                "description": "профессор Гентского университета Крис Каллеверт (Бельгия)"
                            },
                            {
                                "subsubstages": [],
                                "name": "Дискуссия. Ответы на вопросы",
                                "timePeriod": "14:45 – 14:55"
                            }
                        ],
                        "name": "II СИМПОЗИУМ - Акне и акнеформные высыпания: комплексный взгляд на проблему",
                        "speaker": "Модератор: д.м.н., профессор А.Н. Львов",
                        "timePeriod": "13:45 – 15:15"
                    },
                    {
                        "substages": [],
                        "name": "Перерыв (ответы на вопросы)",
                        "timePeriod": "15:15-15:30"
                    },
                    {
                        "substages": [
                            {
                                "subsubstages": [],
                                "name": "Особенности чувствительной кожи",
                                "timePeriod": "15:30 -  15:45",
                                "description": "профессор Андреас Волленберг (Германия)"
                            },
                            {
                                "subsubstages": [],
                                "name": "Губы как «зеркало» организма: на повестке дня хейлиты",
                                "timePeriod": "15:45 – 16:10",
                                "description": "д.м.н., профессор Е.А. Аравийская"
                            },
                            {
                                "subsubstages": [],
                                "name": "Восстановление целостности кожного покрова при дерматологической патологии",
                                "timePeriod": "16:10 – 16:30",
                                "description": "д.м.н., профессор Л.С. Круглова"
                            },
                            {
                                "subsubstages": [],
                                "name": "Дискуссия. Ответы на вопросы",
                                "timePeriod": "16:30 – 16:40"
                            }
                        ],
                        "name": "III СИМПОЗИУМ - Терапия поврежденной кожи: секреты ускоренного заживления",
                        "timePeriod": "15:30-17:00",
                        "speaker": "Модератор: д.м.н., профессор Е.А. Аравийская и д.м.н., профессор Л.С. Круглова"
                    },
                    {
                        "substages": [],
                        "name": "Перерыв (ответы на вопросы)",
                        "timePeriod": "17:00-17:15"
                    }
                ],
                "name": "Зал \"ЛАБИРИНТ ВДОХНОВЕНИЯ\"",
                "streamLink": "https://a5prokat.clients.webcaster.pro/iframe/feed/start/free_9b0c3cff36ebc3cd65ed3a377a93c689/5847_7215357736/f17a223e01f4ffbfefbc26c23fef4d10/4886671975?sr=6227&type_id="
            },
            {
                "program": [
                    {
                        "substages": [
                            {
                                "subsubstages": [],
                                "name": "Вступительное слово ",
                                "timePeriod": "11:45 – 11:50"
                            },
                            {
                                "subsubstages": [],
                                "name": "Калейдоскоп осложнений буллезного эпидермолиза",
                                "timePeriod": "11:50 – 12:05",
                                "description": "О.С. Орлова"
                            },
                            {
                                "subsubstages": [],
                                "name": "Методы эндоскопического лечения стенозов пищевода при буллезном эпидермолизе у детей",
                                "timePeriod": "12:05 – 12:20",
                                "description": "А.В. Тупыленко "
                            },
                            {
                                "subsubstages": [],
                                "name": "Интеграция знаний: пищевая аллергия у детей с врожденным буллезным эпидермолизом. ",
                                "timePeriod": "12:20 - 12:35",
                                "description": "А.А. Галимова "
                            },
                            {
                                "subsubstages": [],
                                "name": "Возможности генной терапии для пациентов с буллезным эпидермолизом ",
                                "timePeriod": "12:35 – 12:50",
                                "description": "к.м.н. Р.В. Епишев"
                            },
                            {
                                "subsubstages": [],
                                "name": "Дискуссия. Ответы на вопросы ",
                                "timePeriod": "12:50 – 13:00"
                            },
                            {
                                "subsubstages": [],
                                "name": "Совершенствование организации медицинской и медико-социальной помощи пациентам с тяжелыми хроническими и редкими (орфанными) заболеваниями",
                                "timePeriod": "13:00 – 13:15",
                                "description": "В.С. Поленова "
                            }
                        ],
                        "name": "I СИМПОЗИУМ - Врожденный буллезный эпидермолиз: современные вызовы и инновационные решения",
                        "timePeriod": "11:45-13:15",
                        "speaker": "Модератор: д.м.н., профессор Н.Н. Мурашкин",
                        "sponsor": "ООО \"Свикс Хэлскеа\". Баллы НМО не начисляются. "
                    },
                    {
                        "substages": [],
                        "name": "Перерыв (ответы на вопросы)",
                        "timePeriod": "13:15-13:45"
                    },
                    {
                        "substages": [
                            {
                                "subsubstages": [],
                                "name": "Разгадывая тайны кожи: интерактивный практикум по дерматоскопии",
                                "timePeriod": "13:45 – 15:15",
                                "description": "Ю.Ю. Сергеев"
                            }
                        ],
                        "name": "II СИМПОЗИУМ - Интерактивный дерматоскопический практикум",
                        "speaker": "Модератор: Ю.Ю. Сергеев",
                        "timePeriod": "13:45 – 15:15"
                    },
                    {
                        "substages": [],
                        "name": "Перерыв (ответы на вопросы)",
                        "timePeriod": "15:15-15:30"
                    },
                    {
                        "substages": [
                            {
                                "subsubstages": [],
                                "name": "Перекрестные проявления ихтиоза и атопического дерматита: вызовы и подходы",
                                "timePeriod": "15:30 - 15:45",
                                "description": "д.м.н., профессор Н.Н. Мурашкин",
                                "sponsor": "Catalysis. Баллы НМО не начисляются."
                            },
                            {
                                "subsubstages": [],
                                "name": "Особенности ведения тяжелых форм атопического дерматита у детей с наличием мутации гена филаггрина ",
                                "timePeriod": "15:45 – 16:00",
                                "description": "д.м.н., профессор Л.С. Круглова"
                            },
                            {
                                "subsubstages": [],
                                "name": "Клинический спектр ангидротической эктодермальной дисплазии: от классических проявлений до атопического дерматита и состояния иммунодефицита",
                                "timePeriod": "16:00 – 16:15",
                                "description": "к.м.н. Р.А. Иванов"
                            },
                            {
                                "subsubstages": [],
                                "timePeriod": "16:15 – 16:30",
                                "name": "Дерматологические маски аутовоспалительных заболеваний ",
                                "description": "В.И. Бурлаков"
                            },
                            {
                                "subsubstages": [],
                                "name": "Нейтрофильные дерматозы: вершина айсберга органных поражений",
                                "timePeriod": "16:30 – 16:45",
                                "description": "А.Я. Аведова"
                            },
                            {
                                "subsubstages": [],
                                "name": "Гипер IgE-синдром: не просто атопический дерматит",
                                "timePeriod": "16:45 - 17:00",
                                "description": "А.А. Моисеева"
                            }
                        ],
                        "name": "III СИМПОЗИУМ - Неочевидные аспекты детской дерматологической практики",
                        "timePeriod": "15:30-17:00",
                        "speaker": "Модератор: д.м.н., профессор Н.Н. Мурашкин и к.м.н. Р.А. Иванов"
                    },
                    {
                        "substages": [],
                        "name": "Перерыв (ответы на вопросы)",
                        "timePeriod": "17:00-17:15"
                    }
                ],
                "name": "Зал \"ТЕРРА ИНКОГНИТА\"",
                "streamLink": "https://a5prokat.clients.webcaster.pro/iframe/feed/start/free_a7ba146ac76cf38540c84790e389312e/5847_5213203330/77dc9802534d33fcd4f280db38cf6017/4886671975?sr=6227&type_id="
            }
        ],
        "prices": [
            {
                "date": "2024-09-15",
                "online": 3000,
                "offline": 3000
            },
            {
                "date": "2024-10-15",
                "online": 3500,
                "offline": 3500
            },
            {
                "date": "2024-10-31",
                "online": 3500,
                "offline": 3500
            }
        ],
        "id": "8e6b761e-0ff4-4068-8feb-f7da3f6c79fa",
        "createdAt": "2024-05-29T15:26:37.420Z",
        "updatedAt": "2024-11-08T05:59:17.735Z",
        "__v": 0
    }




    const [isPopPriceOpen, setIsPopPriceOpen] = useState(false);
    const [isConfirmPopOpen, setIsConfirmPopOpen] = useState(false)

    const [currentPrice, setCurrentPrice] = useState(0);
    const [participationType, setParticipationType] = useState<'online' | 'offline' | 'online-free'>('online');

    const query = useSearchParams().toString();

    const [currentProgram, setCurrentProgram] = useState<{
        name: string, program: Array<{
            timePeriod?: string | undefined;
            sponsor?: string | undefined;
            speaker?: string | undefined;
            substages?: {
                description?: string | undefined;
                sponsor?: string | undefined;
                name: string;
                timePeriod: string;
            }[] | undefined;
            name: string;
        }>
    }>();


    const [needPrice, setNeedPrice] = useState<any>({})
    const [needPriceNext,setNeedPriceNext] = useState('')

    useEffect(() => {
        const today = new Date();
        let events=event?.prices??[]

        // setNeedPrice(events[0])
        // setNeedPriceNext(events[1]?.date)
        for (let i = 0; i < events.length; i++) {
            const currentDate = new Date(events[i].date);
            const nextDate = i + 1 < events.length ? new Date(events[i + 1].date) : null;

            console.log(currentDate,"CURRENT",nextDate,'NEXT')


            if (currentDate <= today && (!nextDate || nextDate > today)) {
                console.log(today,"TODAY")
                setNeedPrice(events[i<2?i+1:2])
                setNeedPriceNext(events[i<2?i+1:2]?.date)

            }
        }



    }, [event]);


    const [registration, setRegistration] = useState<any>()

    const [ticketLink, setTicketLink] = useState('/')


    const [uuid, setUuid] = useState('')

    const [isAdmin, setIsAdmin] = useState(false)

    const [haveAccessToStream, setHaveAccessToStream] = useState(false)



    useEffect(() => {
        eden.user.my.profile.get().then((res) => {

            if (res?.data?.profile?.uuid) {

                setUuid(res.data.profile.uuid)
            }
            setIsAdmin(res?.data?.isAdmin ?? false)

            if (res?.data?.profile?.uuid && event?.id) {
                eden.user.my.participations[event.id].get().then((res) => {

                    if (res.data[0]?.info) setRegistration(res?.data[0])
                    console.log('AAAAAAAAUEEEEEEEEEEEEEEEE', res.data[0])
                    if (res?.data?.find(item => item.meta.participationType == 'online'||item.sum==5500||isAdmin)) {

                        setHaveAccessToStream(true)
                    }
                    event?.id && eden.user.my.participation[event.id].getTicketLink.get().then((res) => {
                        if (res.data) {
                            setTicketLink(res.data.ticketLink)
                        }
                    }).catch(console.log);
                }).catch(console.log)
            }
        }).catch(e => console.log(e))
    }, []);


    const [qrCodeUrl, setQrCodeUrl] = useState()



    useEffect(() => {
        setCurrentProgram(event?.halls[0])
    }, []);

    useEffect(() => {
        console.log(new Date(needPrice.date),"DATE",new Date(),"TODAY",new Date(needPrice.date)<new Date(),'Compare')
    }, [needPrice]);

    const [currentStream, setCurrentStream] = useState('')

    useEffect(() => {
        setCurrentStream(event?.halls[0]?.streamLink)
    }, []);

    const [isNewPack, setIsNewPack] = useState(false)

    return (
        <main className={'overflow-x-hidden'}>
            {/*ПЕРВЫЙ БЛОК*/}
            <motion.div
                className="lg:min-h-screen overflow-hidden py-20 lg:py-8 bg-cover relative">
                <div className={'w-full h-full absolute left-0 top-0 z-[-2]'}>
                    <img className={'w-full h-full object-cover'} src={event?.layoutBg}/>
                </div>
                <div className={'w-full h-full absolute green-gradient opacity-50 left-0 top-0 z-[-1]'}>

                </div>
                <motion.div
                    className={'w-full lg:min-h-screen h-auto px-[20px] lg:px-[140px] grid grid-cols-1 lg:grid-cols-12'}>
                    <motion.div
                        className={'col-span-6 lg:mt-0 sm:mt-20 flex flex-col gap-6 sm:items-start lg:justify-center'}>
                        <BackButton></BackButton>
                        <div className={'flex gap-4 items-center'}>
                            <div
                                className={'flex items-center rounded-full p-2 px-4 uppercase text-white font-light opacity-50 border-white w-fit border-2 justify-center'}>
                                {event?.type}
                            </div>
                        </div>
                        <div className={'flex items-center gap-7'}>
                            <p className={'text-white leading-[100%] opacity-50'}>{event?.date}</p>
                            <div className={'h-full w-[2px] bg-white opacity-50'}>

                            </div>
                            <p className={'text-white leading-[100%] opacity-50'}>{event?.timePeriod}</p>
                        </div>
                        <p className={'text-white text-2xl sm:text-3xl'}>{event?.name}</p>
                        <div className={'flex flex-col gap-4'}>
                            <div className={'flex items-center gap-2'}>
                                <img className={'w-6 aspect-square'} src={`${images}/placemark.svg`}/>
                                <p className={'text-white text-lg'}><strong>Место проведения:</strong> {event?.place}
                                </p>
                            </div>
                            <div className={'flex items-center gap-2'}>
                                <img className={'w-6 aspect-square'} src={`${images}/placemark.svg`}/>
                                <p className={'text-white text-lg'}>
                                    <strong>Формат: </strong> {event?.format?.replace('офлайн', 'очное участие').replace('онлайн + оффлайн', 'Очное участие + видеотрансляция (онлайн)')}
                                </p>
                            </div>
                            <div className={'flex items-center gap-2'}>
                                <img className={'w-6 aspect-square'} src={`${images}/placemark.svg`}/>
                                <p className={'text-white text-lg'}>
                                    <strong>Зарегистрировались</strong> {event?.participants} участников</p>
                            </div>
                        </div>
                        <Link
                            href={event?.name == 'Новогодний марафон: Сказки о главном' ? 'https://t.me/+98oUoQXA70Y1MzUy' : '#form'}>
                            <div
                                className={'bg-white text-lg flex items-center justify-center p-3 px-5 rounded-md cursor-pointer hover:opacity-100 transition-all duration-300 opacity-50 text-black'}>
                                Подтвердить участие клиентская стр
                            </div>
                        </Link>
                    </motion.div>
                </motion.div>
                <div className={'absolute bottom-[-0.5px] sm:bottom-[-4px] asset w-full'}>
                    <img src={'/main_asset_bottom.png'} alt={'asset_bottom'}></img>
                </div>
            </motion.div>
            <div
                className={'bg-white items-center py-12 px-[20px] grid-cols-1 lg:px-[140px] gap-20 grid lg:grid-cols-2'}>
                <img className={'w-full aspect-square col-span-1 object-cover rounded-xl'} src={event?.avatar}/>
                <div className={'flex flex-col gap-6 items-start'}>
                    <p className={'uppercase font-extralight text-3xl sm:text-5xl text-black'}>Информация
                        <br/><span className={'font-extrabold'}>о мероприятии</span></p>
                    <p className={'font-bold uppercase text-green xl:text-3xl text-xl'}>
                        Анонс
                    </p>
                    <p className={'font-normal xl:text-lg text-black'}>
                        {event?.announcement}
                    </p>
                    {event?.description ? <p className={'font-bold uppercase text-green xl:text-3xl text-xl'}>
                        Описание
                    </p> : null}
                    {event?.description ? <p className={'font-normal xl:text-lg text-black'}>
                        {event?.description}
                    </p> : null}
                </div>
            </div>
            {event?.speakers && event?.speakers.length > 0 ? <div
                className={'relative green-gradient overflow-hidden px-[20px] pt-12 sm:h-[900px] flex flex-col items-start sm:pl-[70px] sm:px-[140px]'}>
                <img className={'absolute asset w-full z-50 left-0 top-[-0.5px] sm:top-0'}
                     src={'/about_us_offset_top.png'}/>
                <p className={'text-xl sm:text-5xl sm:px-0 px-[20px] sm:absolute sm:top-[140px] sm:left-[195px] uppercase font-extralight text-white'}>Спикеры <span
                    className={'font-extrabold'}>Конференции</span></p>
                <SpeakersSlider speakers={event?.speakers}></SpeakersSlider>
                <img className={'absolute w-full asset left-0 z-50 bottom-[-0.5px]'} src={'/about_us_offset_bot.png'}/>
            </div> : null}

            {event?.date=='08.06.2024'&&<div><StandLoadingBar title={'Интерактивная выставка - нажми в центр круга, чтобы начать'} clickable={true}/></div>}

            {currentProgram ? <div className={'bg-white py-12 px-[20px] lg:px-[140px]'}>
                <p className={'uppercase font-extralight text-2xl lg:text-5xl text-black'}>Программа
                    <br/><span className={'font-extrabold'}>Конференции</span></p>

                <div className={'flex mt-20 items-center sm:overflow-x-hidden overflow-x-scroll max-w-full gap-16'}>
                    {event?.halls.map((hall, counter) => {
                        return (
                            <div key={counter} onClick={() => {
                                setCurrentProgram(hall)
                            }}
                                 className={classList('flex cursor-pointer items-center whitespace-nowrap xl:text-2xl font-bold justify-center', currentProgram.name == hall.name ? 'border-b-2 border-green-two text-green-two' : 'text-black')}>
                                {hall.name}
                            </div>
                        )
                    })
                    }
                </div>
                <div className={'flex mt-20 flex-col gap-14'}>
                    {currentProgram.program.map((item, counter) => {
                        return (
                            <div key={counter} className={'flex gap-8 flex-col'}>
                                <div
                                    className={'flex lg:grid lg:grid-cols-12 gap-2 lg:gap-6 flex-col lg:flex-row items-start'}>
                                    {item.timePeriod ? <div className={'col-span-2 mr-4 flex items-center gap-2'}>
                                        <img className={'w-4 lg:w-6 aspect-square'} src={`${images}/time.svg`}/>
                                        <div
                                            className={'text-lg lg:text-2xl text-green-two whitespace-nowrap contents font-bold'}>{item.timePeriod}</div>
                                    </div> : null}
                                    <div
                                        className={'text-lg col-span-10 lg:text-2xl whitespace-pre-wrap lg:text-justify font-bold'}>{item.name}</div>
                                </div>
                                {item.speaker ? <div
                                    className={'bg-[#DBEAE8] text-lg p-3 lg:px-14 lg:p-6 lg:text-xl rounded-lg flex items-center justify-start'}>
                                    {item?.sponsor ?
                                        <p>{item.speaker}<span
                                            className={'font-bold'}><br/>При поддержке компании {item.sponsor}</span>
                                        </p> : item.speaker}
                                </div> : null}
                                {item.substages ?
                                    <div className={'p-3 lg:p-8'}>
                                        {item.substages.map((substage, subCounter) => {
                                            if (item.substages) {
                                                return (
                                                    <div key={subCounter} className={'grid grid-cols-12 items-start'}>
                                                        <div
                                                            className={'col-span-1 flex relative items-center h-full flex-col justify-center'}>
                                                            <div
                                                                className={'lg:w-6 w-4 lg:h-6 h-4 absolute top-0 aspect-square rounded-full bg-green-two'}>

                                                            </div>
                                                            <div className={'h-full w-[2px] bg-green-two'}>

                                                            </div>
                                                        </div>
                                                        <div
                                                            className={classList('col-span-11 flex lg:gap-0 gap-3 h-fit flex-col', subCounter < item?.substages?.length - 1 ? 'pb-6 lg:pb-14' : '')}>
                                                            <p className={'lg:text-2xl text-lg w-full text-green-two contents font-bold'}>{substage?.timePeriod}</p>
                                                            <p className={'lg:text-2xl text-lg w-full text-black font-medium'}>{substage?.name}</p>
                                                            {substage?.description ? <div
                                                                className={'bg-[#DBEAE8] p-3 text-lg lg:px-14 lg:p-6 lg:text-xl rounded-lg flex items-center justify-start'}>
                                                                {substage?.sponsor ?
                                                                    <p>{substage.description}<span
                                                                        className={'font-bold'}><br/>При поддержке компании {substage.sponsor}</span>
                                                                    </p> : substage.description}
                                                            </div> : null}
                                                        </div>
                                                    </div>
                                                )

                                            }
                                        })
                                        }
                                    </div>

                                    : null}
                            </div>
                        )
                    })}
                </div>
            </div> : null}


            {event?.date == '11.11.2023' || event?.date == '2023-11-11' ?
                <div className={'my-40 flex px-[20px] lg:px-[140px] items-center flex-col gap-12'}>
                    <motion.p initial={{y: -40, opacity: 0}}
                              whileInView={{y: 0, opacity: 1}}
                              viewport={{once: true}}
                              transition={{ease: 'easeInOut', duration: 0.7}}
                              className={'uppercase font-extralight text-black lg:text-left text-center lg:text-2xl lg:text-4xl'}>Партнёры <strong
                        className={'font-extrabold'}>Конференции</strong></motion.p>
                    <Partners11></Partners11>
                </div> : null}

            {event?.date == '18.12.2023' || event?.date == '2023-11-11' ?
                <div className={'my-40 flex px-[20px] lg:px-[140px] items-center flex-col gap-12'}>
                    <motion.p initial={{y: -40, opacity: 0}}
                              whileInView={{y: 0, opacity: 1}}
                              viewport={{once: true}}
                              transition={{ease: 'easeInOut', duration: 0.7}}
                              className={'uppercase font-extralight text-black lg:text-left text-center lg:text-2xl lg:text-4xl'}>Партнёры <strong
                        className={'font-extrabold'}>Конференции</strong></motion.p>
                    <Partners18></Partners18>
                </div> : null}

            {event?.date == '13.04.2024' ?
                <div className={'my-40 flex px-[20px] lg:px-[140px] items-center flex-col gap-12'}>
                    <motion.p initial={{y: -40, opacity: 0}}
                              whileInView={{y: 0, opacity: 1}}
                              viewport={{once: true}}
                              transition={{ease: 'easeInOut', duration: 0.7}}
                              className={'uppercase font-extralight text-black lg:text-left text-center lg:text-2xl lg:text-4xl'}>Партнёры <strong
                        className={'font-extrabold'}>Конференции</strong></motion.p>
                    <Partners13></Partners13>
                </div> : null}

            {event?.date == '08.06.2024' ?
                <div className={'my-40 flex px-[20px] lg:px-[140px] items-center flex-col gap-12'}>
                    <motion.p initial={{y: -40, opacity: 0}}
                              whileInView={{y: 0, opacity: 1}}
                              viewport={{once: true}}
                              transition={{ease: 'easeInOut', duration: 0.7}}
                              className={'uppercase font-extralight text-black lg:text-left text-center lg:text-2xl lg:text-4xl'}>Партнёры <strong
                        className={'font-extrabold'}>Конференции</strong></motion.p>
                    <Partners08></Partners08>
                </div> : null}

            {event?.date == '31.05.2024' ?
                <div className={'my-40 flex px-[20px] lg:px-[140px] items-center flex-col gap-12'}>
                    <motion.p initial={{y: -40, opacity: 0}}
                              whileInView={{y: 0, opacity: 1}}
                              viewport={{once: true}}
                              transition={{ease: 'easeInOut', duration: 0.7}}
                              className={'uppercase font-extralight text-black lg:text-left text-center lg:text-2xl lg:text-4xl'}>Партнёры <strong
                        className={'font-extrabold'}>Конференции</strong></motion.p>
                    <Partners31></Partners31>
                </div> : null}

            {event?.date == '09.11.2024' ?
                <div className={'my-40 flex px-[20px] lg:px-[140px] items-center flex-col gap-12'}>
                    <motion.p initial={{y: -40, opacity: 0}}
                              whileInView={{y: 0, opacity: 1}}
                              viewport={{once: true}}
                              transition={{ease: 'easeInOut', duration: 0.7}}
                              className={'uppercase font-extralight text-black lg:text-left text-center lg:text-2xl lg:text-4xl'}>Партнёры <strong
                        className={'font-extrabold'}>Конференции</strong></motion.p>
                    <Partners911></Partners911>
                </div> : null}
            {event?.date == '26.10.2024' ?
                <div className={'my-40 flex px-[20px] lg:px-[140px] items-center flex-col gap-12'}>
                    <motion.p initial={{y: -40, opacity: 0}}
                              whileInView={{y: 0, opacity: 1}}
                              viewport={{once: true}}
                              transition={{ease: 'easeInOut', duration: 0.7}}
                              className={'uppercase font-extralight text-black lg:text-left text-center lg:text-2xl lg:text-4xl'}>Партнёры <strong
                        className={'font-extrabold'}>Конференции</strong></motion.p>
                    <Partners2610></Partners2610>
                </div> : null}


            {/*<div className={'bg-[#F2F9F8] relative py-12 lg:py-40 flex items-center px-[20px]'}>*/}
            {/*    <img className={'absolute left-0 -top-1'} src={`/pages/main/about_us_offset.png`}*/}
            {/*         alt={'asset_bottom'}></img>*/}
            {/*    <div className={'w-full'}>*/}
            {/*        <div*/}
            {/*            className={'flex sm:flex-col flex-col gap-8 items-center justify-center sm:items-start sm:justify-between'}>*/}
            {/*            <motion.p initial={{x: -40, opacity: 0}}*/}
            {/*                      whileInView={{x: 0, opacity: 1}}*/}
            {/*                      viewport={{once: true}}*/}
            {/*                      transition={{ease: 'easeInOut', duration: 0.7}}*/}
            {/*                      className={'uppercase sm:pl-[140px] font-extralight text-black sm:text-left text-left text-2xl sm:text-4xl'}>Спонсоры <strong*/}
            {/*                className={'font-extrabold'}>конференции</strong></motion.p>*/}
            {/*            <div className={'sm:px-[40px] w-full '}>*/}
            {/*                <Partners></Partners>*/}
            {/*            </div>*/}
            {/*        </div>*/}
            {/*    </div>*/}
            {/*    <img className={'absolute left-0 bottom-0'} src={`/pages/main/about_us_offset_bottom.png`}*/}
            {/*         alt={'asset_bottom'}></img>*/}
            {/*</div>*/}
            {/*{needPrice.date}*/}

            {event?.date=='28.09.2024'?<div className={'flex justify-center'}>
                <div className={'flex flex-col items-center w-full md:w-1/3 gap-8'}>
                    <div
                        className={'rounded-xl w-full h-96 flex flex-col gap-4 justify-around items-center p-4 bg-green-two'}>
                        <div className={'flex items-center gap-3'}>
                            <img className={'w-7 aspect-square'} src={'/online.svg'}/>
                            <p className={'font-extralight text-3xl text-white'}>Онлайн</p>
                        </div>
                        <p className={'text-3xl lg:text-5xl text-white font-bold'}>БЕСПЛАТНО</p>
                        <p className={'font-extralight text-xl text-center text-white'}>Доступ к
                            онлайн-трансляции в день мероприятия</p>
                    </div>
                    <div onClick={() => {
                        setIsConfirmPopOpen(true);
                        setCurrentPrice(0);
                        setParticipationType('online-free')
                    }}
                         className={'w-full lg:w-auto p-4 bg-green-two text-white cursor-pointer text-lg font-light rounded-xl flex items-center justify-center'}>
                        Подтвердить участие
                    </div>
                </div>
                {isConfirmPopOpen && event?.name && event?.id ? <PopUp icon={'/confirm.svg'} closeFunc={() => {
                    {
                        setIsConfirmPopOpen(false)

                    }
                }}>
                    <ConfirmForm layotBg={event.layoutBg} query={query} participationType={participationType}
                                 closeFunc={() => {
                                     setIsConfirmPopOpen(false)
                                     console.log(currentPrice)
                                 }} price={currentPrice} event_id={event?.id}
                                 event_name={event?.name}></ConfirmForm>
                </PopUp> : null}

            </div>:null}


            {!event?.isOnlyOnline && event?.type != 'Марафон' && (registration?.meta?.participationType != "online-free"||isAdmin)&& (new Date(needPrice.date)>new Date()||event?.date=='09.11.2024')?
                <div className={'bg-white relative lg:py-0 py-12 px-[20px] lg:px-[140px] '}>
                    <div id={'form'} className={'absolute -top-40'}></div>

                    <div
                        className={'flex lg:mt-7 items-center px-[20px] lg:px-[140px] justify-center lg:justify-center'}>
                        {registration?.meta?.participationType == 'offline' || registration?.meta?.participationType == 'online' ?
                            <motion.p initial={{y: -40, opacity: 0}}
                                      whileInView={{y: 0, opacity: 1}}
                                      viewport={{once: true}}
                                      transition={{ease: 'easeInOut', duration: 0.7}}
                                      className={'uppercase font-extralight text-black lg:text-left text-center lg:text-2xl lg:text-4xl'}>Ваш
                                приобретённый <strong
                                    className={'font-extrabold'}>Пакет Участия</strong></motion.p> :
                            <motion.p initial={{y: -40, opacity: 0}}
                                      whileInView={{y: 0, opacity: 1}}
                                      viewport={{once: true}}
                                      transition={{ease: 'easeInOut', duration: 0.7}}
                                      className={'uppercase font-extralight text-black lg:text-left text-left text-2xl lg:text-4xl'}>{event?.date != '11.11.2023' && (<>Стоимость <strong
                                className={'font-extrabold'}>Участия</strong></>)}</motion.p>}
                    </div>
                    {registration?.meta?.participationType == 'offline' || registration?.meta?.participationType == 'online' ?
                        <div className={'grid grid-cols-1 lg:grid-cols-2 mt-10 lg:my-32 gap-10 lg:gap-32 items-start'}>
                            <div className={'flex flex-col gap-4'}>
                                <p className={'lg:text-2xl uppercase font-black'}>Формат: <span
                                    className={'font-light'}>{registration?.info?.participationType.replace('оффлайн', 'очное участие')} {haveAccessToStream ? '+ запись трансляции на 60 дней' : ''}</span>
                                </p>
                                <p className={'lg:text-2xl uppercase font-black'}>Дата и время: <span
                                    className={'font-light'}>{event?.date} в {event?.timePeriod}</span></p>
                                <p className={'lg:text-2xl uppercase font-black'}>Место: <span
                                    className={'font-light'}>{event?.place}</span></p>
                                {ticketLink ? <Link href={ticketLink}
                                                    className={'flex text-white lg:w-96 font-bold items-center justify-center p-3 bg-green-two rounded-lg'}>
                                    Скачать билет на телефон
                                </Link> : null}
                            </div>
                            <div className={'flex items-start lg:items-center justify-end'}>
                                <img className={'w-full lg:w-2/5'} src={registration?.qrCodeUrl}/>
                            </div>
                        </div> : null}


                    {((event?.date != '11.11.2023' && !registration) || isAdmin) ? (<div
                        className={classList('grid grid-cols-1 gap-9 mt-10', event?.prices ? 'lg:grid-cols-3' : 'lg:grid-cols-2')}>
                        {event?.prices ? <div className={'flex flex-col items-center gap-8'}>
                            <div
                                className={'rounded-xl w-full h-96 flex flex-col gap-4 justify-around items-center p-4 bg-green-two'}>
                                <div className={'flex items-center gap-3'}>
                                    <img className={'w-7 aspect-square'} src={'/online.svg'}/>
                                    <p className={'font-extralight text-3xl text-white'}>Онлайн</p>
                                </div>
                                <p className={'text-3xl lg:text-5xl text-white font-bold'}>БЕСПЛАТНО</p>
                                <p className={'font-extralight text-xl text-center text-white'}>Доступ к
                                    онлайн-трансляции в день мероприятия</p>
                            </div>
                            <div onClick={() => {
                                setIsConfirmPopOpen(true);
                                setCurrentPrice(0);
                                setParticipationType('online-free')
                            }}
                                 className={'w-full lg:w-auto p-4 bg-green-two text-white cursor-pointer text-lg font-light rounded-xl flex items-center justify-center'}>
                                Подтвердить участие
                            </div>
                        </div> : null}
                        {needPrice?.online ? <div className={'flex flex-col items-center gap-8'}>
                            <div
                                className={'rounded-xl w-full h-96 flex flex-col gap-4 justify-around items-center p-4 bg-green-two'}>
                                <div className={'flex items-center gap-3'}>
                                    <img className={'w-7 aspect-square'} src={'/online.svg'}/>
                                    <p className={'font-extralight text-3xl text-white'}>Онлайн</p>
                                </div>
                                <p className={'text-3xl lg:text-5xl text-white font-bold'}>{needPrice?.online > 0 ? needPrice?.online + ' руб.' : 'БЕСПЛАТНО'}</p>
                                <p className={'font-extralight text-xl text-center text-white'}>Доступ к
                                    онлайн-трансляции мероприятия <span
                                        className={'font-extrabold'}>{needPrice?.online ? '+ запись трансляции' : ''}</span>
                                </p>
                            </div>
                            <div onClick={() => {
                                setIsConfirmPopOpen(true);
                                if (needPrice?.online) {
                                    setCurrentPrice(needPrice.online);
                                }
                                setParticipationType('online')
                            }}
                                 className={'w-full lg:w-auto p-4 bg-green-two text-white cursor-pointer text-lg font-light rounded-xl flex items-center justify-center'}>
                                Подтвердить участие
                            </div>
                        </div> : null}
                        {needPrice?.offline&&(isAdmin) ? <div className={'flex flex-col items-center gap-8'}>
                            <div
                                className={'rounded-xl w-full h-96 flex flex-col gap-4 justify-around items-center p-4 border-green-two border-4'}>
                                <div className={'flex items-center gap-3'}>
                                    <img className={'w-7 aspect-square'} src={'/offline.svg'}/>
                                    <p className={'font-extralight text-3xl text-green-two'}>Очное участие</p>
                                </div>

                                <p className={'text-3xl lg:text-5xl text-green-two font-bold'}>{needPrice?.offline > 0 ? needPrice?.offline + ' руб.' : 'БЕСПЛАТНО'}</p>
                                {event?.prices ?
                                    <p className={'font-extralight text-xl text-center text-green-two'}>Цена действует
                                        <br/>
                                        {format(new Date(needPriceNext),'dd.MM.yyyy')}</p> : null}
                                {event?.prices ? <p onClick={() => {
                                        setIsPopPriceOpen(true)
                                    }} className={'font-bold cursor-pointer text-xl text-green-two'}>Смотреть график
                                        цен</p> :
                                    <p className={'font-extralight text-xl text-center text-green-two'}>Очное посещение
                                        мероприятия, активное участие</p>}
                            </div>
                            {event?.date == '11.11.2023' && !isAdmin ? <div
                                className={'w-full lg:w-auto p-4 bg-zinc-400  text-white cursor-pointer text-lg font-light rounded-xl flex items-center justify-center'}>Запись
                                закрыта</div> : <div onClick={() => {
                                setIsConfirmPopOpen(true);
                                if (needPrice?.offline) {
                                    setCurrentPrice(needPrice.offline);
                                    console.log(currentPrice)
                                }
                                setParticipationType('offline')
                            }}
                                                     className={'w-full lg:w-auto p-4 bg-green-two text-white cursor-pointer text-lg font-light rounded-xl flex items-center justify-center'}>
                                Подтвердить участие
                            </div>}
                        </div> : null}
                        {event?.date=='09.11.2024'&&isAdmin ?
                            <div className={'flex flex-col items-center lg:col-start-2 gap-8'}>
                                <div
                                    className={'rounded-xl w-full h-96 flex flex-col gap-4 justify-around items-center p-4 border-green-two border-4'}>
                                    <div className={'flex items-center gap-3'}>
                                        <img className={'w-7 aspect-square'} src={'/offline.svg'}/>
                                        <p className={'font-extralight text-3xl text-green-two'}>Очное участие</p>
                                    </div>

                                    <p className={'text-3xl lg:text-5xl text-green-two font-bold'}>{event?.date=='09.11.2024'?4000:5500} руб.</p>
                                    {event?.prices ?
                                        <p className={'text-xl text-center  font-bold text-green-two'}>+ запись
                                            трансляции
                                            на 60 дней</p> : null}
                                    {event?.prices ? <p onClick={() => {
                                            setIsPopPriceOpen(true)
                                            setIsNewPack(true)
                                        }} className={'font-bold cursor-pointer text-xl text-green-two'}>Смотреть график
                                            цен</p> :
                                        <p className={'font-extralight text-xl text-center text-green-two'}>Очное
                                            посещение
                                            мероприятия, активное участие</p>}
                                </div>
                                <div onClick={() => {
                                    setIsConfirmPopOpen(true);
                                    setCurrentPrice(event?.date=='09.11.2024'?4000:5500)
                                    setParticipationType('offline')
                                }}
                                     className={'w-full lg:w-auto p-4 bg-green-two text-white cursor-pointer text-lg font-light rounded-xl flex items-center justify-center'}>
                                    Подтвердить участие
                                </div>
                            </div> : null}
                    </div>) : null}
                    {isConfirmPopOpen && event?.name && event?.id ? <PopUp icon={'/confirm.svg'} closeFunc={() => {
                        {
                            setIsConfirmPopOpen(false)

                        }
                    }}>
                        <ConfirmForm layotBg={event.layoutBg} query={query} participationType={participationType}
                                     closeFunc={() => {
                                         setIsConfirmPopOpen(false)
                                         console.log(currentPrice)
                                     }} price={currentPrice} event_id={event?.id}
                                     event_name={event?.name}></ConfirmForm>
                    </PopUp> : null}

                    {isPopPriceOpen ? <PopUp icon={'/price.svg'} closeFunc={() => {
                        {
                            setIsPopPriceOpen(false)
                            setIsNewPack(false)
                        }
                    }}>
                        <div className={'flex gap-4 h-full flex-col'}>
                            <p className={'text-[#0F5F5A] text-2xl lg:text-4xl font-light'}>ГРАФИК <br/> <span
                                className={'font-extrabold'}>СТОИМОСТИ</span></p>
                            <div className={'grid p-2 w-full grid-cols-2'}>
                                <div className={'text-[#0F5F5A] font-light flex items-center '}>
                                    Дата
                                </div>
                                <div className={'text-[#0F5F5A] gap-2 font-light flex items-center '}>
                                    <p className={'text-[#0F5F5A] font-light'}>Стоимость</p>
                                </div>
                            </div>
                            {event?.prices?.map((item: any, counter: any) => {
                                return (
                                    <div key={counter}
                                         className={'grid p-2 bg-[#7AB8AD] bg-opacity-10 rounded-lg w-full grid-cols-2'}>
                                        <div className={'text-[#0F5F5A] font-light flex items-center '}>
                                            {format(item.date, 'dd.MM.yyyy')}
                                        </div>
                                        <div className={'text-[#0F5F5A] gap-2 font-light flex items-center '}>
                                            <p className={'text-[#0F5F5A] font-light'}>{isNewPack ? item.offline + (counter == 2 ? 1000 : 500) : item.offline} рублей</p>
                                        </div>
                                    </div>
                                )
                            })}

                            <div className={'w-full grid grid-cols-2 gap-3'}>
                                <div onClick={() => {
                                    setIsPopPriceOpen(false)
                                }}
                                     className={'p-4 cursor-pointer bg-green-two text-white text-sm font-light rounded-xl flex items-center justify-center'}>Вернуться
                                    к мероприятию
                                </div>
                            </div>
                        </div>
                    </PopUp> : null}
                </div> : null}


            {haveAccessToStream||event?.date=='09.11.2024' ?
                <div className={'bg-white relative lg:py-0 py-12 px-[20px] lg:px-[90px] '}>
                    <div id={'form'} className={'absolute -top-40'}></div>
                    <div
                        className={'flex lg:mt-7 items-center px-[20px] lg:px-[140px] justify-center lg:justify-center'}>
                        <motion.p initial={{y: -40, opacity: 0}}
                                  whileInView={{y: 0, opacity: 1}}
                                  viewport={{once: true}}
                                  transition={{ease: 'easeInOut', duration: 0.7}}
                                  className={'uppercase font-extralight text-black lg:text-left text-center text-left text-2xl lg:text-4xl'}>Онлайн-трансляция <strong
                            className={'font-extrabold'}>мероприятия</strong></motion.p>
                    </div>
                    <div
                        className={'flex mt-20 items-center sm:justify-center sm:overflow-x-hidden overflow-x-scroll max-w-full gap-7 sm:gap-16'}>
                        {event?.halls.map((hall, counter) => {
                            return (
                                <div key={counter} onClick={() => {
                                    setCurrentStream(hall?.streamLink)
                                }}
                                     className={classList('flex cursor-pointer items-center whitespace-nowrap xl:text-2xl font-bold justify-center', currentStream == hall?.streamLink ? 'border-b-2 border-green-two text-green-two' : 'text-black')}>
                                    {hall.name}
                                </div>
                            )
                        })
                        }
                    </div>
                    {/*?sr=6227&type_id=&width=1280&height=720&iframe_width=1280&iframe_height=720&lang=ru*/}
                    {/*?sr=6227&type_id=&width=320&height=240&iframe_width=320&iframe_height=240&lang=ru*/}
                    <div className={'lg:flex items-center min-w-[1280px] hidden my-12 justify-center'}>
                        <iframe width="1280" height="720"
                                src={currentStream+'&width=1280&height=720'}
                                title="IV-я научно-практическая конференция «Путь детской дерматологии: от истоков к перспективам»"
                                frameBorder="0"
                                allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
                                allowFullScreen></iframe>
                        {/*<iframe width="560" height="315"*/}
                        {/*        src="https://www.youtube.com/embed/jICoaRhx9ns?si=B-UctiHhoned-TnJ"*/}
                        {/*        title="YouTube video player" frameBorder="0"*/}
                        {/*        allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"*/}
                        {/*        allowFullScreen></iframe>*/}
                    </div>

                    <div className={'lg:hidden items-center  flex my-12 justify-center'}>
                        <iframe width="320" height="240"
                                src={currentStream+'&width=320&height=240'}
                                title="IV-я научно-практическая конференция «Путь детской дерматологии: от истоков к перспективам»"
                                frameBorder="0"
                                allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
                                allowFullScreen></iframe>
                    </div>


                    {isConfirmPopOpen && event.id ? <PopUp icon={'/confirm.svg'} closeFunc={() => {
                        {
                            setIsConfirmPopOpen(false)
                        }
                    }}>
                        <ConfirmForm layotBg={event.layoutBg} query={query} participationType={participationType}
                                     closeFunc={() => {
                                         setIsConfirmPopOpen(false)
                                     }} price={currentPrice} event_id={event?.id}
                                     event_name={event?.name}></ConfirmForm>
                    </PopUp> : null}

                    {isPopPriceOpen ? <PopUp icon={'/price.svg'} closeFunc={() => {
                        {
                            setIsPopPriceOpen(false)
                        }
                    }}>
                        <div className={'flex gap-4 h-full flex-col'}>
                            <p className={'text-[#0F5F5A] text-2xl lg:text-4xl font-light'}>ГРАФИК <br/> <span
                                className={'font-extrabold'}>СТОИМОСТИ</span></p>
                            <div className={'grid p-2 w-full grid-cols-2'}>
                                <div className={'text-[#0F5F5A] font-light flex items-center '}>
                                    Дата
                                </div>
                                <div className={'text-[#0F5F5A] gap-2 font-light flex items-center '}>
                                    <p className={'text-[#0F5F5A] font-light'}>Стоимость</p>
                                </div>
                            </div>
                            {event?.prices?.map((item: any, counter: any) => {
                                return (
                                    <div key={counter}
                                         className={'grid p-2 bg-[#7AB8AD] bg-opacity-10 rounded-lg w-full grid-cols-2'}>
                                        <div className={'text-[#0F5F5A] font-light flex items-center '}>
                                            {item.date}
                                        </div>
                                        <div className={'text-[#0F5F5A] gap-2 font-light flex items-center '}>
                                            <p className={'text-[#0F5F5A] font-light'}>{item.offline} рублей</p>
                                        </div>
                                    </div>
                                )
                            })}

                            <div className={'w-full grid grid-cols-2 gap-3'}>
                                <div onClick={() => {
                                    setIsPopPriceOpen(false)
                                }}
                                     className={'p-4 cursor-pointer bg-green-two text-white text-sm font-light rounded-xl flex items-center justify-center'}>Вернуться
                                    к мероприятию
                                </div>
                            </div>
                        </div>
                    </PopUp> : null}
                </div> : null}

            <div className={'my-12 flex flex-col'}>
                {event?.date == '11.11.2023' || event?.date == '2023-11-11' ?
                    <Link className={' text-dark-green underline mb-12 text-xl font-bold px-[20px] lg:px-[140px]'}
                          target={'_blank'}
                          href={'/kpfile.pdf'}>Коммерческое предложение</Link> : null}


                {event?.date == '09.11.2024' || event?.date == '2023-11-11' ?
                    <Link className={' text-dark-green underline mb-12 text-xl font-bold px-[20px] lg:px-[140px]'}
                          target={'_blank'}
                          href={'/kpfile09_11.pdf'}>Коммерческое предложение</Link> : null}


                {/*{event?.date == '08.06.2024' ?*/}
                {/*    <Link className={' text-dark-green underline mb-12 text-xl font-bold px-[20px] lg:px-[140px]'}*/}
                {/*          target={'_blank'}*/}
                {/*          href={'/kpfile08_06.pdf'}>Коммерческое предложение</Link> : null}*/}
                {event?.date == '11.11.2023' || event?.date == '2023-11-11' ?
                    <div className={'flex flex-col gap-2'}>
                        <p className={'whitespace-pre-wrap mt-2 px-[20px] text-dark-green  lg:px-[140px] font-bold'}>Участие
                            в мероприятии</p>
                        <p className={'whitespace-pre-wrap mt-2 px-[20px] lg:px-[140px] text-black'}>
                            1) Для участия в мероприятии (онлайн-трансляция) необходимо зарегистрироваться на сайте <a
                            className={'font-bold text-green-two'}
                            href={'https://pediatric-dermatology.ru'}>https://pediatric-dermatology.ru</a> (https://pediatric-dermatology.ru/),
                            указав следующие данные: <br/>1. ФИО, <br/>2.Электронный адрес <br/>3. Место работы, <br/>4.
                            Должность, <br/>5. Специальность, <br/>6. Номер телефона. <br/>Учет участников
                            осуществляется с помощью индивидуальной регистрации на интернет-сессию и контроля
                            подключения по IP адресу. Контроль присутствия будет обеспечивать интерактивные опросы через
                            разные временные интервалы. Вход на трансляцию осуществляется не ранее, чем за 2 часа до её
                            начала. При завершении трансляции, сеанс у всех присутствующих прекращается. Инструментами
                            обратной связи являются `&quot;`Чат трансляции`&quot;`. Участниками мероприятия будут признаны слушатели, присутствующие 9 ноября 2024 года (1 день) - не менее 180 минут для программы НМО на трансляции и подтверждавшие 3 контроля присутствия из 4. Участникам
                            выполнившим все требования в мероприятии, выдаются индивидуальные коды.
                            <br/><br/>
                            2) Для участия в мероприятии (очное участие) необходимо обязательно предварительно
                            зарегистрироваться на сайте <a className={'font-bold text-green-two'}
                                                           href={'https://pediatric-dermatology.ru'}>https://pediatric-dermatology.ru</a>,
                            (https://pediatric-dermatology.ru/) указав следующие данные: <br/>1. ФИО, <br/>2.Электронный
                            адрес <br/>3. Место работы, <br/>4. Должность, <br/>5. Специальность, <br/>6. Номер
                            телефона. <br/>Перед началом мероприятия, все заранее зарегистрированные лица получат бейджи
                            с последующим контролем присутствия до окончания мероприятия. Участниками мероприятия будут
                            признаны слушатели, присутствующие 11 ноября 2023 года (1 день) по адресу город Москва,
                            кластер `&quot;`Ломоносов`&quot;` (ИНТЦ МГУ Воробьёвы горы, Раменский бульвар, 1) с 10:00 -
                            18:45. Участникам выполнившим все требования в мероприятии, выдаются индивидуальные коды
                        </p>
                    </div> : null}


                {event?.date == '09.11.2024' || event?.date == '2023-11-09' ?
                    <div className={'flex flex-col gap-2'}>
                        <p className={'whitespace-pre-wrap mt-2 px-[20px] text-dark-green  lg:px-[140px] font-bold'}>Участие в мероприятии</p>
                        <p className={'whitespace-pre-wrap mt-2 px-[20px] lg:px-[140px] text-black'}>
                            1) Для участия в мероприятии (онлайн-трансляция) необходимо зарегистрироваться на сайте <a className={'font-bold text-green-two'} href={'https://pediatric-dermatology.ru'}>https://pediatric-dermatology.ru</a> (https://pediatric-dermatology.ru/), указав следующие данные: <br/>1. ФИО, <br/>2. Электронный адрес <br/>3. Место работы,
                            <br/>4. Должность, <br/>5. Специальность, <br/>6. Номер телефона. <br/>Учет участников осуществляется с помощью
                            индивидуальной регистрации на интернет-сессию и контроля подключения по IP адресу. Контроль присутствия будет
                            обеспечивать интерактивные опросы через разные временные интервалы. Вход на трансляцию осуществляется не ранее,
                            чем за 2 часа до её начала. При завершении трансляции, сеанс у всех присутствующих прекращается. Инструментами
                            обратной связи являются &quot;Чат трансляции&quot;. Участниками мероприятия будут признаны слушатели, присутствующие 9 ноября 2024 года (1 день) - не менее 180 минут для программы НМО на трансляции и подтверждавшие 3 контроля присутствия из 4.
                            Участникам,  выполнившим все требования мероприятия, выдаются индивидуальные коды.
                            <br/><br/>
                            2) Для участия в мероприятии (очное участие) необходимо обязательно предварительно зарегистрироваться на сайте <a className={'font-bold text-green-two'} href={'https://pediatric-dermatology.ru'}>https://pediatric-dermatology.ru</a> (https://pediatric-dermatology.ru/) указав следующие данные: <br/>1. ФИО, <br/>2. Электронный адрес <br/>3. Место работы,
                            <br/>4. Должность, <br/>5. Специальность, <br/>6. Номер телефона. <br/>Перед началом мероприятия, все заранее
                            зарегистрированные лица получат бейджи с последующим контролем присутствия до окончания мероприятия. Участниками
                            мероприятия будут признаны слушатели, присутствующие 9 ноября 2024 года (1 день) по адресу город Москва, кластер
                            &quot;Ломоносов&quot; (ИНТЦ МГУ Воробьёвы горы, Раменский бульвар, 1) с 10:00 - 18:45. Участникам, выполнившим все требования
                            мероприятия, выдаются индивидуальные коды.
                        </p>
                    </div>

                    : null}






                {/*{event?.date == '08.06.2024' ?*/}
                {/*    <div className={'flex flex-col gap-2'}>*/}
                {/*        <p className={'whitespace-pre-wrap mt-2 px-[20px] text-dark-green  lg:px-[140px] font-bold'}>Участие*/}
                {/*            в мероприятии</p>*/}
                {/*        <p className={'whitespace-pre-wrap mt-2 px-[20px] lg:px-[140px] text-black'}>*/}
                {/*            1) Для участия в мероприятии (онлайн-трансляция) необходимо зарегистрироваться на сайте*/}
                {/*            https://pediatric-dermatology.ru, указав следующие данные: 1. ФИО, 2.Электронный адрес 3.*/}
                {/*            Место работы, 4. Должность, 5. Специальность, 6. Номер телефона. Учет участников*/}
                {/*            осуществляется с помощью индивидуальной регистрации на интернет-сессию и контроля*/}
                {/*            подключения по IP адресу. Контроль присутствия будет обеспечивать интерактивные опросы через*/}
                {/*            разные временные интервалы. Вход на трансляцию осуществляется не ранее, чем за 2 часа до её*/}
                {/*            начала. При завершении трансляции, сеанс у всех присутствующих прекращается. Инструментами*/}
                {/*            обратной связи являются `&quot;`Чат трансляции`&quot;`. Участниками мероприятия будут признаны слушатели,*/}
                {/*            присутствующие 8 июня 2024 года (1 день) - не менее 270 минут для программы НМО на*/}
                {/*            трансляции и подтвердившие 5 контролей присутствия из шести. Участникам, выполнившим все*/}
                {/*            требования в мероприятии, выдаются индивидуальные коды.*/}

                {/*            2) Для участия в мероприятии (очное присутствие) необходимо обязательно предварительно*/}
                {/*            зарегистрироваться на сайте https://pediatric-dermatology.ru, указав следующие данные: 1.*/}
                {/*            ФИО, 2.Электронный адрес 3. Место работы, 4. Должность, 5. Специальность, 6. Номер телефона.*/}
                {/*            Перед началом мероприятия, все заранее зарегистрированные люди получат бейджи с последующим*/}
                {/*            контролем присутствия до окончания мероприятия. Участниками мероприятия будут признаны*/}
                {/*            слушатели, присутствующие 8 июня 2024 года (1 день) по адресу г. Москва, Сколково, ул. Блеза*/}
                {/*            Паскаля д. 2 с 10:00 - 17:40. Участникам, выполнившим все требования в мероприятии, выдаются*/}
                {/*            индивидуальные коды.*/}
                {/*        </p>*/}
                {/*    </div> : null}*/}

            </div>

            <div className={'bg-white lg:py-0 py-12 lg:h-[600px]'}>
                <div className={'flex lg:mt-7 items-center px-[20px] lg:px-[140px] justify-center lg:justify-between'}>
                    <motion.p initial={{x: -40, opacity: 0}}
                              whileInView={{x: 0, opacity: 1}}
                              viewport={{once: true}}
                              transition={{ease: 'easeInOut', duration: 0.7}}
                              className={'uppercase font-extralight text-black lg:text-left text-left text-2xl lg:text-4xl'}>Другие <strong
                        className={'font-extrabold'}>Мероприятия</strong></motion.p>
                </div>
                <motion.div className={'mt-12 w-full flex px-[20px] lg:px-[40px]'}
                            initial={{y: -40, opacity: 0}}
                            whileInView={{y: 0, opacity: 1}}
                            viewport={{once: true}}
                            transition={{ease: 'easeInOut', duration: 0.7}}>
                    <News currentId={event?.id}></News>
                </motion.div>
            </div>
        </main>
    )
}
